10/data/attachments/28aff6242c79111.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_d6f7e3ce-c392-4fac-b951-4a2e2c4aff44</nif:username>
            <nif:friendToBeAdded>Evan_especially_Actions_41893_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>